In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100,
dtype='l'))
print(s1, s2, s3)

0     2
1     4
2     1
3     2
4     3
     ..
95    1
96    3
97    4
98    3
99    2
Length: 100, dtype: int32 0     2
1     2
2     2
3     1
4     3
     ..
95    2
96    3
97    3
98    3
99    2
Length: 100, dtype: int32 0     11099
1     17109
2     18901
3     22008
4     13385
      ...
95    14880
96    29585
97    17393
98    18105
99    25543
Length: 100, dtype: int32

In [3]:
#Let's create a DataFrame by joinning the Series by column
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  2  2  11099
1  4  2  17109
2  1  2  18901
3  2  1  22008
4  3  3  13385

In [5]:
#Change the name of the columns to bedrs, bathrs,price_sqr_meter
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2:
'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            11099
1      4       2            17109
2      1       2            18901
3      2       1            22008
4      3       3            13385

In [6]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)
# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()

In [9]:
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       4
2       1
3       2
4       3
..    ...
95  14880
96  29585
97  17393
98  18105
99  25543

[300 rows x 1 columns]

In [10]:
len(bigcolumn)

300

In [11]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        4
2        1
3        2
4        3
..     ...
295  14880
296  29585
297  17393
298  18105
299  25543

[300 rows x 1 columns]